In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('sales-data.txt')

In [8]:
df.head()

         Date                 SKU  Unit Price  Quantity  Total Price
0  2019-01-01  Death by Chocolate         180         5          900
1  2019-01-01          Cake Fudge         150         1          150
2  2019-01-01          Cake Fudge         150         1          150
3  2019-01-01          Cake Fudge         150         3          450
4  2019-01-01  Death by Chocolate         180         1          180

In [5]:
sum(df['Total Price'])

4583270

In [6]:
month_name = {'01':'January','02':'February','03':'March'}

In [7]:
def month_from_date(date):
    return month_name[date.split('-')[1]]

In [9]:
df['Month'] = df['Date'].map(month_from_date)

In [10]:
df.head()

         Date                 SKU  Unit Price  Quantity  Total Price    Month
0  2019-01-01  Death by Chocolate         180         5          900  January
1  2019-01-01          Cake Fudge         150         1          150  January
2  2019-01-01          Cake Fudge         150         1          150  January
3  2019-01-01          Cake Fudge         150         3          450  January
4  2019-01-01  Death by Chocolate         180         1          180  January

In [12]:
df.groupby('Month').sum()

          Unit Price  Quantity  Total Price
Month
February      469580     13152      1422350
January       468330     13200      1421330
March         575760     15983      1739590

In [36]:
df.groupby(['Month','SKU']).sum()['Quantity'].sort_values(ascending = False)

Month     SKU
March     Hot Chocolate Fudge              3100
January   Hot Chocolate Fudge              2673
February  Hot Chocolate Fudge              2636
March     Cake Fudge                       2408
          Vanilla Double Scoop             2204
January   Vanilla Double Scoop             2101
February  Vanilla Double Scoop             2082
          Cake Fudge                       1878
January   Cake Fudge                       1771
March     Death by Chocolate               1696
          Vanilla Single Scoop             1682
          Butterscotch Single Scoop        1676
January   Vanilla Single Scoop             1398
          Butterscotch Single Scoop        1374
February  Death by Chocolate               1287
          Butterscotch Single Scoop        1273
          Vanilla Single Scoop             1269
January   Death by Chocolate               1238
March     Cafe Caramel                      768
January   Cafe Caramel                      751
February  Cafe Caramel                      670
March     Dry Fruit Single Scoop            191
          Dry Fruit Double Scoop            185
January   Dry Fruit Double Scoop            182
March     Chocolate Europa Double Scoop     177
          Caramel Crunch Single Scoop       175
          Chocolate Europa Single Scoop     174
February  Dry Fruit Single Scoop            174
January   Caramel Crunch Single Scoop       168
March     Caramel Crunch Double Scoop       167
                                           ...
February  Rocky Road Single Scoop           137
January   Rocky Road Single Scoop           133
February  Caramel Crunch Double Scoop       128
          Butterscotch Double Scoop         121
January   Chocolate Europa Single Scoop     116
          Pista Single Scoop                113
          Butterscotch Double Scoop         111
          Chocolate Europa Double Scoop     104
          Fig and Honey Double Scoop        100
          Fig and Honey Single Scoop         98
March     Dew Drop Sundae                    88
January   Dry Fruit Single Scoop             86
          Trilogy                            85
March     Mint Fudge                         85
          Trilogy                            85
February  Caramel Crunch Single Scoop        83
March     Banana Split                       74
January   Banana Split                       73
March     Almond Fudge                       71
January   Almond Fudge                       68
February  Trilogy                            68
January   Mint Fudge                         65
February  Rocky Road Double Scoop            63
          Almond Fudge                       63
January   Dew Drop Sundae                    58
          Rocky Road Double Scoop            58
February  Banana Split                       58
          Mint Fudge                         57
March     Rocky Road Double Scoop            57
February  Dew Drop Sundae                    47
Name: Quantity, Length: 75, dtype: int64

In [46]:
df[df.SKU == 'Hot Chocolate Fudge'].groupby('Month').mean()

          Unit Price  Quantity  Total Price
Month
February       120.0  3.097532   371.703878
January        120.0  3.030612   363.673469
March          120.0  2.955195   354.623451